// Створення об'єкта:
// Створіть об'єкт, який представляє інформацію про вас. Об'єкт повинен містити властивості, такі як ім'я, вік, місто тощо.

// Метод об'єкта:
// Додайте до попереднього об'єкта метод, який виводить інформацію про вас в зручному форматі (наприклад, в консоль).

// Перебирання властивостей:
// Створіть функцію, яка приймає об'єкт і виводить в консоль всі його властивості та їхні значення.

// Зміна властивостей:
// Додайте до попереднього об'єкта метод, який дозволяє змінювати значення певної властивості.

// Масив об'єктів:
// Створіть масив об'єктів, де кожен об'єкт представляє інформацію про різних користувачів (ім'я, вік, місто).

// Пошук об'єкта за властивістю:
// Напишіть функцію, яка приймає масив об'єктів і шукає користувача за ім'ям чи іншою властивістю.

// Метод map для об'єкта:
// Створіть метод об'єкта, який використовує подібний до map метод для перетворення значень властивостей об'єкта.

// Метод filter для об'єкта:
// Створіть метод об'єкта, який використовує подібний до filter метод для фільтрації об'єкта за певною умовою.

// Об'єкт для замовлення товарів:
// Створіть об'єкт, який представляє замовлення товарів. У цьому об'єкті повинні бути властивості, такі як товари, кількість, адреса доставки тощо.

// Метод для підрахунку вартості:
// Додайте до об'єкта з попереднього завдання метод, який підраховує загальну вартість замовлення (кількість товару помножити на ціну).