// Підрахунок суми:
// Створіть функцію, яка приймає масив чисел і повертає їхню суму.

// Фільтрація парних чисел:
// Створіть функцію, яка приймає масив чисел і повертає новий масив, який містить лише парні числа.

// Знаходження максимального елемента:
// Створіть функцію, яка приймає масив чисел і повертає найбільший елемент у цьому масиві.

// Перетворення масиву:
// Створіть функцію, яка приймає масив чисел і повертає новий масив, в якому кожен елемент збільшений на 2.

// Перевірка на парність:
// Створіть функцію, яка приймає масив чисел і повертає true, якщо всі числа парні, та false в іншому випадку.

// Фільтрація за умовою:
// Створіть функцію, яка приймає масив користувачів (об'єктів) і фільтрує їх за певною умовою (наприклад, вік більше 25).

// Об'єднання масивів:
// Створіть функцію, яка приймає декілька масивів і об'єднує їх в один.

// Знаходження перший парного числа:
// Створіть функцію, яка приймає масив чисел і повертає перше парне число.

// Знаходження індексу елемента:
// Створіть функцію, яка приймає масив та елемент і повертає індекс цього елемента в масиві (або -1, якщо елемент не знайдено).

// Сортування об'єктів за властивістю:
// Створіть функцію, яка приймає масив об'єктів і сортує їх за певною властивістю (наприклад, вік чи ім'я).